src/Catalogs/FileFolders.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>FileFolders</Name>
			<Comment>Folder structure for storage of files</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/FileFolders/Ext/ObjectModule.bsl
Procedure BeforeWrite(Cancellation)
	If NOT DataExchange.Load Then
		
		IBCheck = DeletionMarkInIB();
		If DeletionMark And Not IBCheck Then
			
			// Check right "Mark for deletion".
			If NOT FileOperationsOverrided.DeletionMarkSettingPermitted(Ref) Then
				Raise StringFunctionsClientServer.SubstitureParametersInString(
				                     NStr("en = 'You do not have the right ""Mark for deletion"" of the folder ""%1"".'"),
				                     String(Ref));
			EndIf;
		EndIf;
		
		If DeletionMark <> IBCheck And Not Ref.IsEmpty() Then
			// Select files and try to mark them for deletion
			Query = New Query;
			Query.Text = 
				"SELECT
				|	Files.Ref,
				|	Files.LockedBy
				|FROM
				|	Catalog.Files AS Files
				|WHERE
				|	Files.FileOwner = &Ref";
			
			Query.SetParameter("Ref", Ref);
			
			Result = Query.Execute();
			Selection = Result.Choose();
			While Selection.Next() Do
				If Not Selection.LockedBy.IsEmpty() Then
					Raise StringFunctionsClientServer.SubstitureParametersInString(
					                     NStr("en = '%1 folder cannot be deleted as it contains ""%2""  file that is being edited.'"),
					                     String(Ref),
					                     String(Selection.Ref));
				EndIf;

				FileObject = Selection.Ref.GetObject();
				FileObject.Lock();
				FileObject.SetDeletionMark(DeletionMark);
			EndDo;
		EndIf;
		
		AdditionalProperties.Insert("PastIsNew", IsNew());
		
		If NOT IsNew() Then
			
			If Description <> Ref.Description Then // folder was renamed
				WorkingDirectoryOfThisFolders = FileOperations.GetWorkingDirectory(Ref);
				WorkingDirectory = FileOperations.GetWorkingDirectory(Ref.Parent);
				If WorkingDirectory <> "" Then
					
					// Add closing slash, if it is missing
					If Right(WorkingDirectory,1) <> "\" Then
						WorkingDirectory = WorkingDirectory + "\";
					EndIf;
					
					WorkingDirectoryInheritedOld = WorkingDirectory + Ref.Description + "\";
					If WorkingDirectoryInheritedOld = WorkingDirectoryOfThisFolders Then
						WorkingDirectory = WorkingDirectory + Description + "\";
						FileOperations.SaveWorkingDirectory(Ref, WorkingDirectory);
					EndIf;
				EndIf;
			EndIf;
			
			If Parent <> Ref.Parent Then // moved folder to a different folder
				WorkingDirectoryOfThisFolders = FileOperations.GetWorkingDirectory(Ref);
				WorkingDirectory = FileOperations.GetWorkingDirectory(Ref.Parent);
				WorkingDirectoryNew = FileOperations.GetWorkingDirectory(Parent);
				If WorkingDirectory <> "" OR WorkingDirectoryNew <> "" Then
					
					WorkingDirectoryInheritedOld = WorkingDirectory;
					
					If WorkingDirectory <> "" Then
						WorkingDirectoryInheritedOld = WorkingDirectoryInheritedOld + Ref.Description + "\";
					EndIf;
					
					If WorkingDirectoryInheritedOld = WorkingDirectoryOfThisFolders Then // working directory is autogenerated from the parent
						
						If WorkingDirectoryNew <> "" Then
							WorkingDirectoryNew = WorkingDirectoryNew + Description + "\";
							FileOperations.SaveWorkingDirectory(Ref, WorkingDirectoryNew);
						Else
							FileOperations.ClearWorkingDirectory(Ref);
						EndIf;
					EndIf;
				EndIf;
			EndIf;
			
		EndIf;
		
	EndIf;
EndProcedure

Procedure OnWrite(Cancellation)
	If NOT DataExchange.Load Then
		
		If AdditionalProperties.PastIsNew Then
			OwnerWorkingDirectory = FileOperations.GetWorkingDirectory(Parent);
			If OwnerWorkingDirectory <> "" Then
				
				// Add closing slash, if it is missing
				If Right(OwnerWorkingDirectory,1) <> "\" Then
					OwnerWorkingDirectory = OwnerWorkingDirectory + "\";
				EndIf;
				
				OwnerWorkingDirectory = OwnerWorkingDirectory + Description + "\";
				FileOperations.SaveWorkingDirectory(Ref, OwnerWorkingDirectory);
			EndIf;
		EndIf;		
		
	EndIf;
EndProcedure

Procedure Filling(FillingData, StandardProcessing)
	CreationDate = CurrentDate();
	Responsible = CommonUse.CurrentUser();
EndProcedure

// Returns current deletion mark value in the infobase
Function DeletionMarkInIB()
	Query = New Query;
	Query.Text = 
		"SELECT
		|	FileFolders.DeletionMark
		|FROM
		|	Catalog.FileFolders AS FileFolders
		|WHERE
		|	FileFolders.Ref = &Ref";

	Query.SetParameter("Ref", Ref);

	Result = Query.Execute();

	If Not Result.IsEmpty() Then
		Selection = Result.Choose();
		Selection.Next();
		Return Selection.DeletionMark;
	EndIf;	
	
	Return Undefined;
EndFunction

Procedure FillCheckProcessing(Cancellation, CheckedAttributes)
	If NOT FileOperationsClientServer.FolderOrFileNameConsistsOfValidCharsForFileSystem(Description) Then
		Cancellation = True;
		
		Text = NStr("en = 'Folder description contains not allowed symbols ( \ / : * ? "" < > | .. )'");
		CommonUseClientServer.MessageToUser(Text, ThisObject, "Description");
	EndIf;
EndProcedure
